app/workers/applications_worker.rb

INSERT INTO "applications" ("token", "name", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["token", "_notPr3aL9xdrKzIoQmV0A"], ["name", "Facebook"], ["created_at", "2022-01-20 00:34:51.105869"], ["updated_at", "2022-01-20 00:34:51.105869"]]
SELECT  "applications".* FROM "applications" WHERE "applications"."token" = $1 LIMIT $2  [["token", "dkrF1rfyotd25nsszS2B8w"], ["LIMIT", 1]]
UPDATE "applications" SET "name" = $1, "updated_at" = $2 WHERE "applications"."id" = $3  [["name", "facebook7"], ["updated_at", "2022-01-19 14:20:22.805742"], ["id", 8]]
DELETE FROM "applications" WHERE "applications"."id" = $1  [["id", 2]]
SELECT  "applications".* FROM "applications" WHERE "applications"."token" = $1 LIMIT $2  [["token", "HH8im_TzueIPI6ZXWzAEeg"], ["LIMIT", 1]]
---
  def work(raw_post)
    ActiveRecord::Base.connection_pool.with_connection do
      app_json = JSON.parse(raw_post)
      method = app_json["method"]
      app_json.delete("method")
      if method == "create"
        app = Application.create!(app_json)
      elsif method == "update"
        @application = Application.find_by(token: app_json["token"])
        @application.update_attributes(:name => app_json["name"])
      elsif method == "delete"
        Application.find_by(token: app_json["token"]).destroy