app/workers/chats_worker.rb

INSERT INTO "chats" ("number", "application_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["number", 1], ["application_id", 1], ["created_at", "2022-01-20 00:37:49.850622"], ["updated_at", "2022-01-20 00:37:49.850622"]]
DELETE FROM "chats" WHERE "chats"."id" = $1  [["id", 7]]
---
  def work(raw_post)
    ActiveRecord::Base.connection_pool.with_connection do
      chat_json = JSON.parse(raw_post)
      method = chat_json["method"]
      chat_json.delete("method")
      app_id = get_app_id chat_json["app_token"]
      chat_json.delete("app_token")
      chat_attr = {
        number: chat_json["number"],
        application_id: app_id
      }
      if method == "create"
        chat = Chat.create!(chat_attr)
      elsif method == "delete"
        Chat.find_by(chat_attr).destroy

SELECT  "applications".* FROM "applications" WHERE "applications"."token" = $1 LIMIT $2  [["token", "_notPr3aL9xdrKzIoQmV0A"], ["LIMIT", 1]]
---
  def get_app_id(token)
    Application.find_by(token: token).id