app/workers/messages_worker.rb

INSERT INTO "messages" ("number", "content", "chat_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["number", 1], ["content", "Hi"], ["chat_id", 1], ["created_at", "2022-01-20 00:40:58.488868"], ["updated_at", "2022-01-20 00:40:58.488868"]]
DELETE FROM "messages" WHERE "messages"."id" = $1  [["id", 2]]
SELECT  "messages".* FROM "messages" WHERE "messages"."chat_id" = $1 AND "messages"."number" = $2 LIMIT $3  [["chat_id", 1], ["number", 2], ["LIMIT", 1]]
UPDATE "messages" SET "content" = $1, "updated_at" = $2 WHERE "messages"."id" = $3  [["content", "Hello World"], ["updated_at", "2022-01-20 00:41:38.518292"], ["id", 2]]
---
  def work(raw_post)
    ActiveRecord::Base.connection_pool.with_connection do
      msg_json = JSON.parse(raw_post)
      method = msg_json["method"]
      chat_id = get_chat_id msg_json["app_token"], msg_json["chat_number"]
      msg_attr = {
        content: msg_json["content"],
        number: msg_json["number"],
        chat_id: chat_id
      }
      if method == "create"
        Message.create!(msg_attr)
      elsif method == "delete"
        Message.find_by(chat_id: chat_id, number: msg_json["number"]).destroy
      elsif method == "update"
        Message.find_by(chat_id: chat_id, number: msg_json["number"]).update(msg_attr)