app/controllers/applications_controller.rb

  def index
    @applications = Application.all
---
SELECT "applications".* FROM "applications"

  def update
    if params[:application][:name].present? && params[:token].present?
---
SELECT  "applications".* FROM "applications" WHERE "applications"."token" = $1 LIMIT $2  [["token", "xbSWSgRqNdhsmGnlM-Ijzg"], ["LIMIT", 1]]
SELECT  1 AS one FROM "applications" WHERE "applications"."token" = $1 AND "applications"."id" != $2 LIMIT $3  [["token", "Y6njYGCV_WKNqOtzKWdruA"], ["id", 5], ["LIMIT", 1]]

  def set_application
    @application = Application.find_by(token: params[:token])
---
SELECT  "applications".* FROM "applications" WHERE "applications"."token" = $1 LIMIT $2  [["token", "_notPr3aL9xdrKzIoQmV0A"], ["LIMIT", 1]]