app/controllers/chats_controller.rb

  def set_chat
    @chat = @app.chats.find_by(number: params[:number])
---
SELECT  "chats".* FROM "chats" WHERE "chats"."number" = $1 LIMIT $2  [["number", 3], ["LIMIT", 1]]

  def set_app
    @app = Application.find_by(token: params[:application_token])
---
SELECT  "applications".* FROM "applications" WHERE "applications"."token" = $1 LIMIT $2  [["token", "wc6ObmJn-EJl1kSQws7eug"], ["LIMIT", 1]]