app/controllers/messages_controller.rb

  def index
    @messages = @chat.messages.all
---
SELECT "messages".* FROM "messages" WHERE "messages"."chat_id" = $1  [["chat_id", 2]]

  def update
    if params[:message][:content].present? && params[:application_token].present? && params[:chat_number].present?
---
SELECT  "messages".* FROM "messages" WHERE "messages"."number" = $1 LIMIT $2  [["number", 2], ["LIMIT", 1]]

  def destroy
    if params[:message][:content].present? && params[:application_token].present? && params[:chat_number].present?
---
SELECT  "messages".* FROM "messages" WHERE "messages"."number" = $1 LIMIT $2  [["number", 2], ["LIMIT", 1]]

  def set_message
    @message = Message.find_by(number: params[:number])
---
SELECT  "messages".* FROM "messages" WHERE "messages"."number" = $1 LIMIT $2  [["number", 2], ["LIMIT", 1]]

  def set_app
    @app = Application.find_by(token: params[:application_token])
---
SELECT  "applications".* FROM "applications" WHERE "applications"."token" = $1 LIMIT $2  [["token", "_notPr3aL9xdrKzIoQmV0A"], ["LIMIT", 1]]