app/models/application.rb

SELECT COUNT(*) FROM "chats" WHERE "chats"."application_id" = $1  [["application_id", 7]]
UPDATE "applications" SET "chats_count" = $1, "updated_at" = $2 WHERE "applications"."id" = $3  [["chats_count", 0], ["updated_at", "2022-01-19 12:38:35.768622"], ["id", 7]]
---
  def cached_chats_count
    if($redis.get("#{self.token}-CHATS_COUNT"))
      $redis.get("#{self.token}-CHATS_COUNT")
    else
      chats_count = self.chats.count
      $redis.set("#{self.token}-CHATS_COUNT",chats_count, ex: 3600)
      self.chats_count = chats_count
      self.save!