app/models/chat.rb

SELECT  "applications".* FROM "applications" WHERE "applications"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT COUNT(*) FROM "messages" WHERE "messages"."chat_id" = $1  [["chat_id", 12]]
UPDATE "chats" SET "messages_count" = $1, "updated_at" = $2 WHERE "chats"."id" = $3  [["messages_count", 0], ["updated_at", "2022-01-19 09:08:24.684192"], ["id", 12]]
---
  def cached_messages_count
    if($redis.get("#{self.application.token}-#{self.number}-MSGS_COUNT"))
      $redis.get("#{self.application.token}-#{self.number}-MSGS_COUNT")
    else
      msg_count = self.messages.count
      $redis.set("#{self.application.token}-#{self.number}-MSGS_COUNT",msg_count, ex: 3600)
      self.messages_count = msg_count
      self.save!